onvif-ws-discovery/src/main/java/org/me/javawsdiscovery/sampleResponseOnvif.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
                   xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
                   xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
    <SOAP-ENV:Header>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
        <wsa:MessageID>uuid:32f05949-5256-1fa8-3972-2a9e66b4</wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:acac63be-ba61-458a-98d3-83ca045304a8</wsa:RelatesTo>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <d:AppSequence InstanceId="1234" MessageNumber="28"></d:AppSequence>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:0004634c-ec65-65ec-4c63-040004634c63</wsa:Address>
                </wsa:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
                <d:Scopes>onvif://www.onvif.org/type/Network_Video_Transmitter onvif://www.onvif.org/Profile/Streaming
                    onvif://www.onvif.org/name/Bosch onvif://www.onvif.org/location/
                    onvif://www.onvif.org/hardware/FLEXIDOME_NDN-498-P
                </d:Scopes>
                <d:XAddrs>http://192.168.188.200:80/onvif/device_service
                    https://192.168.188.200:443/onvif/device_service
                </d:XAddrs>
                <d:MetadataVersion>1234</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
